---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.WallFailures.InvalidTargetPosition
source: html/c3c1c964-46dd-2da3-8d92-ddbb2e0e6582.htm
---
# Autodesk.Revit.DB.BuiltInFailures.WallFailures.InvalidTargetPosition Property

Joining the highlighted wall to the highlighted element moves the wall's top below its bottom or its bottom above its top, or interferes with wall joins or holes in the wall.

## Syntax (C#)
```csharp
public static FailureDefinitionId InvalidTargetPosition { get; }
```